enhance: added diagrams
